# # Користувач вводить з клавіатури два числа. Необхідно знайти суму чисел, різницю чисел, добуток числі. Результат обчислень вивести на екран.
#
# num1 = input("Ввудіть перше число: ")
# num1 = int(num1)
#
# num2 = input("Введіть друге число: ")
# num2 = int(num2)
#
# result = num1 + num2, num1 - num2, num1 * num2, num1 / num2
# print(result)
#
# # Користувач вводить із клавіатури два числа. Перше число — це значення, друге число відсоток, який необхідно порахувати. Наприклад, ми ввели з клавіатури 50 і 10. Потрібно вивести на екран 10 відсотків від 50. Результат: 5.
# num1 = input("Введіть перше число: ")
# number = int(num1)
#
# num2 = input("Введіть друге число: ")
# percent = float(num2)
#
# result = number * (percent / 100)
# print(result)
#
#
# # Напишіть програму, що обчислює площу прямокутника. Користувач з клавіатури вводить ширину і висоту прямокутника.
# num1 = input("Введіть ширину: ")
# width = float(num1)
#
# num2 = input("Введіть довжину: ")
# height = float(num2)
#
# result = width * height
# print(result)
#
#
# # Користувач вводить з клавіатури довжину сторони квадрата. Напишіть програму, яка обчислює і виводить на екран периметр квадрата за формулою:
# # P = 4 х a
# # де a — довжина сторони квадрата.
# num1 = input("Введіть сторону квадрата А: ")
# square_side = float(num1)
#
# result = 4 * square_side
# print(result)
#
#
# # Напишіть програму, яка перетворює довжину з метрів у сантиметри. Користувач вводить значення довжини в метрах, програма має обчислити та вивести на екран результат у сантиметрах. Нагадайте, що 1 метр = 100 сантиметрів.
# num1 = input("Введіть метри: ")
# meter = float(num1)
# result = meter*100
# print(result)
#
#
#
# # Користувач вводить з клавіатури кількість літрів фарби, необхідної для фарбування однієї стіни. Напишіть програму, яка обчислить, скільки літрів фарби потрібно для фарбування чотирьох стін однакового розміру. Приклад: якщо для однієї стіни потрібно 2 літри фарби, програма повинна вивести, що для чотирьох стін потрібно 8 літрів.
# num1 = input("Введіть кількість літрів фарби: ")
# paint = int(num1)
#
# result = 4 * paint
# print(result)



# Користувач вводить з клавіатури температуру за шкалою Цельсія. Потрібно перевести температуру в градуси за Фаренгейтом і вивести на екран.
temperature = input("Введіть температуру по Цельсію: ")
Celsius = float(temperature)

Fahrenheit = Celsius * 9/5 + 32
print("Градусів по Фаренгейту", Fahrenheit)

# Користувач вводить із клавіатури значення в євро. Напишіть програму, яка переводить цю суму в долари, використовуючи курс євро, введений з клавіатури. Результат виводиться на екран.
currency = input("Введіть суму євро: ")
Euro = float(currency)

Dollar = Euro * 1.15
print("Сума в доларах", Dollar)
# Користувач вводить із клавіатури дві цифри. Необхідно створити число, що містить ці цифри. Наприклад, якщо з клавіатури введено 9, 7, тоді потрібно сформувати число 97.

# Користувач вводить суму вкладу та відсоткову ставку. Напишіть програму, яка:
# Обчислює, скільки користувач отримає через 5 років, якщо щороку сума вкладу збільшується на вказаний відсоток.
# Виводить суму вкладу за кожен рік окремо.


print("Hello, world!")

