# # Користувач вводить свій вік та ім’я. Якщо вік менше 0 то
# # спитати ще раз, поки буде правильним.
# # Вивести привітання у форматі «Привіт, Джон. Тобі 42
# # роки»
# age = int(input("Введіть свій вік: "))
# name = input("Як Ваше ім'я: ")
#
# while age >= 150 or age <= 0:
#      age = int(input("Введіть коректний вік: "))
#
# print(f"Привіт, {name}. Тобі {age} років")
#
# # Користувач вводить числа, поки їхня сума не стане більше
# # 100. В кінці програми покажіть суму всіх чисел.
#
# total = 0
#
# while total <= 100:
#     number = int(input("Введіть число: "))
#     total += number
#
# print(f"Сума всіх чисел: {total}")
#
# # Користувач вводить оцінки студента, поки не введе -1.
# # Після цього виведіть кількість оцінок та середню оцінку.
#
# count = 0
# total = 0
#
# while True:
#     score = int(input("Введіть оцінку (-1 для завершення): "))
#
#     if score == -1:
#         break
#
#     total += score
#     count += 1
#
# if count > 0:
#     average = total / count
#     print(f"Кількість оцінок: {count}")
#     print(f"Середній бал: {average}")
# else:
#     print("Оцінки не введені")
#
# # Користувач вводить довжину в метрах. Покажіть її у
# #  Ярдах(1 ярд = 0,9144 метра)
# #  Футах(1 фут = 0,3048 метра)
# # В кінці спитайте користувача чи продовжувати роботу
# # програми.
#
# yard = 0.9144
# fut = 0.3048
#
# while True:
#     meters = float(input("Величина в метрах: "))
#     ask = input("В що перевести (yard/fut): ")
#
#     if ask == "yard" :
#         yard = meters / yard
#         print(f"В ярдах це буде {yard}")
#
#     elif ask == "fut" :
#         fut = meters / fut
#         print(f"В фнтах це буде {fut}")
#
#     else:
#         print("Продовжити роботу (так/ні)?")
#         break
#
# Напишіть простий калькулятор. Функціонал:
# 1. Сума
# 2. Різниця
# 3. Добуток
# 4. Вихід
# Користувач обирає дію, після чого вводить два числа. Тоді
# програма показує результат і продовжує працювати.
# Якщо вибрано вихід – програма зупиняє роботу.

print("1. Сума")
print("2. Різниця")
print("3. Добуток")
print("4. Вихід")

while True:
    num1 = int(input("Введіть число 1: "))
    num2 = int(input("Введіть число2 :"))
    user_choice = int(input("Оберіть дію (1-4): "))
    if user_choice == 4:
        print("Кінець програми")
        break

    elif user_choice == 1:
        sum = num1 + num2
        print(f"Сума {sum}")

    elif user_choice == 2:
        min = num1 - num2
        print(f"Різниця {min}")

    elif user_choice == 3:
        max = num1 * num2
        print(f"Добуток {max}")

    else:
        print("Невідома команда")
