# Користувач вводить рядок та індекс. Виведіть символ під
# цим індексом. Якщо індекс завеликий, виведіть інформацію
# про помилку.l

raw = input("Введіть рядок: ")
index = int(input("Введіть індекс: "))

if 0 <= index < len(raw):
    print("Символ за індексом:", raw[index])
else:
    print("Індекс завеликий")


#Користувач вводить рядок та два індекси. Виведіть зріз рядка.

text = input("Введіть рядок: ")
index1 = int(input("Введіть індекс1: "))
index2 = int(input("Введіть індекс2: "))

print("Зріз рядка: ", text[index1 : index2])


# Користувач вводить рядок та число n. Виведіть перші n символів. Також виведіть останні n символів.

text = input("Введіть рядок: ")
digit = int(input("Введіть число: "))

print("Перші n символів:", text[:digit])
print("Останні n символів:", text[-digit:])

#Користувач вводить рядок. Перевірте чи це речення(закінчується на .!?)

text = input("Введіть рядок: ")

if text[-1] in '.!?':
    print("Це ручення")

#  Користувач вводить рядок. Перевірте чи це
#  паліндром(читається задом наперед так само).
#  Приклади: Кіт утік, око, потоп

text = input("Введіть рядок: ")

if text == text[::-1]:
    print(f"Паліндром, {text[::-1]} ")
else:
    print(f"Не паліндром, {text}")

#Користувач вводить рядок та символ. Виведіть індекс цього символу.

text = input("Введіть рядок: ")
symbol = input("Введіть символ: ")

index = text.index(symbol)

print(index)

# Користувач вводить рядок та символ. Виведіть усі індекси цього символу, якщо він зустрічається декілька разів.

raw = input("Введіть рядок: ")
symbol = input("Введіть символ: ")

for i in range(len(raw)):
    symbol = raw[i]
    print(i, symbol)
