# # Користувач вводить з клавіатури два числа.
# # Вкажіть усі числа у заданому діапазоні.
#
# start = int(input("Введіть перше число: "))
# stop = int(input("Введіть друге число: "))
#
# for number in range(start, stop+1):
#     print(number)
#
# # Користувач вводить з клавіатури два числа.
# # Вкажіть усі непарні числа у заданому діапазоні.
#
# start = int(input("Введіть перше число: "))
# stop = int(input("Введіть друге число: "))
#
#
# for number in range(start, stop):
#     if number % 2 != 0:
#         print(f"Непарне число {number}")
# else:
#         print("end")
#
#
# # Користувач вводить з клавіатури два числа.
# # Вкажіть усі парні числа у заданому діапазоні.
# start = int(input("Введіть перше число: "))
# stop = int(input("Введіть друге число: "))
#
# for number in range(start, stop):
#     if number % 2 == 0:
#         print(f"Парне число {number}")
# else:
#         print("end")
#
#
# # Користувач вводить з клавіатури два числа.
# # Вкажіть усі числа у заданому діапазоні за спаданням.
#
# start = int(input("Введіть перше число: "))
# stop = int(input("Введіть друге число: "))
#
# for number in range(start, stop -1, -1):
#     print(number)
#
#
# # Користувач вводить з клавіатури два числа. Вкажіть
# # усі непарні числа у заданому діапазоні. Якщо межі
# # діапазону вказані неправильно, потрібно провести
# # нормалізацію меж. Наприклад, користувач ввів 33 і 13.
# # Потрібна нормалізація, після якої початок діапазону
# # дорівнюватиме 13, а кінець дорівнюватиме 33.
#
# start = int(input("Введіть перше число: "))
# stop = int(input("Введіть друге число: "))
#
# start, stop = stop, start
# for number in range(start, stop):
#     if number % 2 != 0:
#         print(f"Непарне число {number}")
#     else:
#         print("end")
#


 # Additional tasks
# # Користувач вводить з клавіатури два числа. Розрахуйте суму чисел у вказаному діапазоні, а також
# # середнє арифметичне.
start = int(input("Введіть перше число: "))
stop = int(input("Введіть друге число: "))

for number in range(start, stop):
     print(f"Сума чисел {start + stop}")
     print(f"Середнє арифметичне {start + stop / 2}")

# Користувач вводить з клавіатури число. Розрахуйте
# факторіал числа. Наприклад, якщо введено 3,
# факторіал числа 1*2*3 = 6.
# Формула для розрахунку факторіалу: n! = 1*2*3…*n,
# де n — число для розрахунку факторіалу.

num = int(input("Введіть число: "))

factorial = 1

for number in range(1, num + 1):
    factorial *= number

print(f"Факторіал числа {num} = {factorial}")

# Користувач вводить з клавіатури довжину лінії. Відобразіть на екрані горизонтальну лінію із символів *
# зазначеної довжини.
# Наприклад, якщо було введено 7, тоді виведення на
# екран буде таким: *******.

long = int(input("Введіть довжину лінії: "))

for number in range(long+1):
    print(f"Довжина лінії: {long} ")


