# Користувач вводить зарплату працівника. Якщо вона
# менша за мінімальну(8000 грн) то вивести повідомлення
# «Замала зарплата», інакше – «Розмір зарплати задовільний»

salary = int(input("Введіть зарплату працівника: "))

if salary <= 8000:
    print("Замала зарплата")
else:
    print("Розмір зарплати задовільний")

#Користувач вводить назву дня тижня.
# Виведіть чи це вихідний(субота, неділя) чи
# будень(понеділок, вівторок, середа, четвер, п’ятниця)

day = input("Введіть день тижня: ")

work_days = ("понеділок", "вівторок", "середа", "четвер", "п’ятниця")
holidays = ("субота", "неділя")

if day in work_days:
    print("Будень")

else:
    print("вихідний")

#Користувач вводить вік, виведіть назву навчального
# закладу, куди його потрібно відправити:
#  до 6 років – дитсадок
#  6-11 років – початкова школа
#  11-18 років – середня школа
#  18-22 – університет
#  22+ – онлайн курси

age = int(input ("Введіть свій вік: "))

if age < 6:
    print("дитсадок")

elif 6 <= age < 11:
    print("початкова школа")

elif 11 <= age < 18:
    print("середня школа")

elif 18 <= age < 22:
    print("університет")

else:
    print("онлайн курси")

#Користувач вводить назву місяця та число. Виведіть що сьогодні за день
#  31 грудня – Новий рік
#  1 січня – перший день року
#  25 грудня – Різдво
#  інакше – звичайний день
month = input("Введіть назву місяця: ")
date = int(input("Введіть число: "))

if month == "грудень" and date == 31:
    print("Новий рік")

elif month == "січень" and date == 1:
    print("Перший день року")

elif month == "грудень" and date == 25:
    print("Різдво")

else:
    print("Звичайний день")


#Користувач вводить свій вік.
# Якщо менше 18 років – вивести повідомлення «Надто малий»
# Інакше спитати чи є водійські права(відповідь так або ні).
# Якщо є -- вивести повідомлення «Можна водити авто», інакше – «Отримайте права»

age = int(input("Введіть свій вік:"))

if age < 18:
    print("Надто малий")

else:
    drive_license = input("Чи є водійське посвідчення: так/ні")

    if drive_license == "так":
        print("Можна водити авто")

    else:
        print("Отримайте права")






