# # comment(python will ignore it, it's not code)
#
# # data/information/meaning
# 15    #ціле число int
# 1.7   #дробове число (тільки через крапку) float
# "Привіт"  #текст str
#
# # робота з данними
# # Оператори та функції
#
# # Оператор
# # [значення1] [оператор] [значення3]
#
# 2 + 10
# 5.1 * 12
# 3 / 2
# 20 - 15
# "привіт" * 3 # повтори слово привіт тричі
#
# # функції
# # [нфзва функції] ([значення1]), [значення2], ....)
#
# # print -- показує данні на екрані
# print(20)
# print(10, 1.7, 2)
# print("привіт")
#
# # max/min -- знаходить максимальне/мінімальне значення
# max(10, 8, 20, 1) #20
#
# # в одному рядку може бути багато операцій
# 2 + 16 * 3
# print(10 - 4)

# # змінні - назва змінної може бути будь-яке(придумуємо самостійно), містить лише латиницю, цифри та _
# # [назва змінної] = [значення]
# numbers = 15
# user_name = "Antonina"
# car_price = 1000
# # не може починатися з цифр і назва має бути осмислена
#
# # використання змінної
# print(age)
#
# age = 22
#
# print(age)
# # людина подорослішала на 1 рік
# age = age + 1

# типа данних
# користувач вводить 2 числа, покажіть суму
# щоб отримати дані від користувача скористайтесь функцією input

input("Підказка, введіть число: ")
# зберегти дані від користувача у змінну
num1 = input("Введіть перше число: ")
num2 = input("Введіть друге число: ")

print(num1, num2)

# СУМА ЧИСЕЛ
result = num1 + num2
print(result)