# Користувач вводить оцінку за іспит(від 1 до 5) поки не
# введе правильне число. Після цього виведіть цю оцінку
# текстом
# 1. Дуже погано
# 2. Погано
# 3. Задовільно
# 4. Добре
# 5. Чудово

print("1. Дуже погано")
print("2. Погано")
print("3. Задовільно")
print("4. Добре")
print("5. Чудово")

while True:
    user_select = int(input("Введіть оцінку: "))

    if user_select == 1:
        print("Дуже погано")
        break
    elif user_select == 2:
        print("Погано")
        break
    elif user_select == 3:
        print("Задовільно")
        break
    elif user_select == 4:
        print("Добре")
        break
    elif user_select == 5:
        print("Чудово")
        break
    else:
        print("Такої оцінки немає")



# Проводиться опитування «Чи потрібно будувати більше
# дитячих садків у вашому місті?»
# Напишіть програму для підрахунку відповідей.
# Користувач вводить слова «так» або «ні» поки не введе слово
# «стоп», після чого треба показати кількості «так» та «ні» і
# також яких голосів більше.
# Якщо введено невідоме слово, то вивести повідомлення
# про помилку та продовжити підрахунок

count_yes = 0
count_no = 0

while True:
    user_choice = input("Чи потрібен новий дитячий садок (так, ні, стоп): ")

    if user_choice == "стоп":
        print("Кінець програми")
        break

    elif user_choice == "так":
        count_yes += 1
        continue

    elif user_choice == "ні":
        count_no += 1
        continue

print("Результати опитування:")
print(f"Так: {count_yes}")
print(f"Ні: {count_no}")








