# Користувач вводить колір світлофора. Виведіть одну з дій:
#  Зелений – їхати
#  Жовтий – приготуватись
#  Червоний – стоп

light = input("Введіть колір світлофору (зелений, жовтий, червоний): ")

if light == 'Зелений':
    print("їхати")
elif light == 'Жовтий':
    print('приготуватись')
elif light == 'Червоний':
    print('стоп')
else:
    print('немає такого кольору')

#Користувач вводить розмір футболки(S, M, L або XL).
# Якщо введено S або M – спитайте колір футболки(немає
# фіолетових та жовтих)
# Якщо введено L – повідомте що всі футболки цього
# розміру закінчились
# Якщо введено XL – спитайте тип тканини(є лише бавовна)
# В результаті програма повинна вивести «Є в наявності»
# або «Немає в наявності»

size = input("Введіть розмір футболки (S, M, L або XL): ")

if size == 'S' or size == 'M':
    color = input("Який колір футболки обираєте?: ")
    if color == 'фіолетовий' or color == 'жовтий':
        print("Такого кольору немає у наявності")
    else:
        print("Є в наявності")

elif size == 'L':
    print("Розміри закінчилися")

elif size == 'XL':
    cloth = input("Який тип тканини обираєте?: ")
    if cloth == 'бавовна':
        print("Є в наявності")
    else:
        print("Немає в наявності")


#Користувач вводить свій дохід, наявність судимостей(так
# або ні) та вік.
# Якщо дохід більше 20 000 грн, немає судимостей та
# користувач старший 21 року – виведіть фразу, що можна
# отримати кредит, інакше що не можна

income = float(input("Введіть свій місячний дохід: "))
presence_of_criminal_records = input("Чи є у Вас судимість (так/ні): ")
age = int(input("Введіть свій вік: "))

if income >= 20000 and presence_of_criminal_records == 'ні' and age > 21:
    print("Кредит отримати можна")

else:
    print("Не можна отримати кредит")