# Користувач вводить слова через пропуск а також число N. Відсортуйте ці слова в алфавітному порядку та
# виведіть перші N слів з відсортованого списку

word = input("Введіть слова через пробіл: ")
num = int(input("Введіть число: "))

new_word = sorted(word.split())
result = new_word[: num]
print(result)


# Користувач вводить слова через пропуск. Добавте до кожного слова @gmail.com та виведіть новий список слів
word = input("Введіть слова через пробіл: ")

email = []

for words in word.strip().split():
    email.append(words + " @gmail.com")

print(email)

# Проводиться опитування. Користувачі можуть дати 5
# варіантів відповіді:
#  негативно
#  скоріше негативно
#  нейтрально
#  скоріше позитивно
#  позитивно
# Створіть 2 списки: з варіантами відповідями та
# кількостями відповідей на кожен варіант.
# Користувач вводить варіанти відповідей, поки не введе
# Домашнє завдання
# END
# Після чого виведіть статистику скільки людей як саме
# відповіли у форматі:
# 10 – негативно
# 27 – скоріше негативно

answers = ["негативно", "скоріше негативно", "нейтрально", "скоріше позитивно", "позитивно"]
amount = [0, 0, 0, 0, 0]


while True:
    user_select = input("Введіть Ваш варіант (негативно, скоріше негативно, нейтрально, скоріше позитивно, позитивно): ")
    if user_select == "END":
        break

    if user_select not in answers:
        print("Такого варіанту немає")
        continue


    idx = answers.index(user_select)
    amount[idx] += 1

    for i in range(len(answers)):
        print(amount[i], "–", answers[i])






