# Користувач вводить свій рік народження. Виведіть його вік.
birth_year = int(input("Введіть свій рік народження: "))

current_year = 2025 - birth_year

print(f"Вам {current_year} років")

# Щоб створити одну глиняну фігурку треба 130 грам глини. Користувач вводить масу глини в кілограмах. Виведіть
# скільки фігурок він зможе зробити. Наприклад, з 2 кг глини можна зробити 15 фігурок

mass_of_clay = float(input("Введіть масу глини в кг: "))

figure_mass = mass_of_clay * 1000 / 130

print(f"Ви зможете виготоваити {figure_mass:.0f} фігурок")


# Користувач вводить радіус кола. Виведіть довжину кола.
# Вважайте що =3.141593 Округліть результат до трьох знаків після коми.

r = float(input("Введіть радіус кола: "))

l = 2 * 3.141593 * r

print(f"Довжина кола {l:.3f}")

# Користувач вводить 3 числа. Виведіть їхнє середнє арифметичне.

num = int(input("Введіть перше число: "))
num1 = int(input("Введіть друге число: "))
num2 = int(input("Введіть третє число: "))

result = num + num1 + num2
average = result / 3

print("Середнє арифметичне: ", average)
