# Користувач вводить з клавіатури два числа (початок та
# кінець діапазону). Проаналізуйте усі числа у цьому діапазоні
# за наступним правилом: якщо число кратне 7, його треба
# вивести на екран.

start = int(input("Введіть перше число: "))
stop = int(input("Введіть друге число: "))

for number in range(start, stop+1):
    if number % 7 == 0:
       print(f"Кратне 7: {number}")

# Користувач вводить з клавіатури два числа (початок та
# кінець діапазону). Проаналізуйте усі числа у цьому діапазоні.
# Виведіть на екран:
# 1. Усі числа діапазону.
# 2. Усі числа діапазону за спаданням.
# 3. Усі числа, кратні 7.
# 4. Кількість чисел, кратних 5.

start = int(input("Введіть перше число: "))
stop = int(input("Введіть друге число: "))

#Усі числа діапазону
for number in range(start, stop+1):
    print(number)

#Усі числа діапазону за спаданням.
start = int(input("Введіть перше число: "))
stop = int(input("Введіть друге число: "))

for number in range(start, stop-1, -1):
    print(number)

#Усі числа, кратні 7.
start = int(input("Введіть перше число: "))
stop = int(input("Введіть друге число: "))

for number in range(start, stop+1):
    if number % 7 == 0:
        print(f"Число кратне {number}")

#Кількість чисел, кратних 5
start = int(input("Введіть перше число: "))
stop = int(input("Введіть друге число: "))

start, stop = sorted([start, stop])
for number in range(start, stop+1):
    if number % 5 == 0:
        print(f"Число кратне 5: {number}")

print(f"Загальна кількість чисел: {sorted([start, stop])}") #підказав пайчарм, але я хотіла вивести саме останнє число з стоп (останнє число)

# Користувач вводить з клавіатури два числа (початок та кінець
# діапазону). Проаналізуйте усі числа у цьому діапазоні. Виведення на екран має відбуватися за правилами, наведеними нижче.
# Якщо число кратне 3 (ділиться на 3 без остачі), виведіть
# слово «Fizz». Якщо число кратне 5, виведіть слово «Buzz». Якщо
# число кратне 3 та 5, виведіть «Fizz Buzz». Якщо число не кратне
# ні 3, ані 5, виведіть тільки число.

start = int(input("Введіть перше число: "))
stop = int(input("Введіть друге число: "))

for number in range(start, stop+1):
    if number % 3 == 0 and number % 5 == 0:
        print("FizzBuzz")
    elif number % 5 == 0:
        print("Buzz")
    elif number % 3 == 0:
        print("Fizz")
    else:
        print(f"Не кратне 3 або 5: {number}")
